src/test/projects/depgraph-maven-plugin-test/expectations/by-groupid_module-3.mmd
flowchart TD
  %% Node Definitions:
  com.github.ferstl:compile["com.github.ferstl"]
  commons-codec:compile["commons-codec"]
  org.apache.commons:compile["org.apache.commons"]
  com.google.guava:compile["com.google.guava"]
  com.mysema.querydsl:compile["com.mysema.querydsl"]
  com.google.code.findbugs:compile["com.google.code.findbugs"]
  com.mysema.commons:compile["com.mysema.commons"]
  com.infradna.tool:compile["com.infradna.tool"]

  %% Edge Definitions:
  com.github.ferstl:compile --> commons-codec:compile
  com.github.ferstl:compile --> org.apache.commons:compile
  com.github.ferstl:compile --> com.google.guava:compile
  com.mysema.querydsl:compile --> com.google.code.findbugs:compile
  com.mysema.querydsl:compile --> com.mysema.commons:compile
  com.mysema.querydsl:compile --> com.infradna.tool:compile
  com.github.ferstl:compile --> com.mysema.querydsl:compile
